1password
btrfs-assistant
caffeine-ng
extension-manager
geekbench
google-chrome
gruvbox-dark-gtk
gruvbox-dark-icons-gtk
gruvbox-material-gtk-theme-git
gruvbox-material-icon-theme-git
gtk-theme-numix-solarized
i3-scrot
jetbrains-toolbox
kube-ps1
lazydocker
looking-glass
mkpasswd2-git
otf-hasklig
picom-git
postman-bin
rcm
rofi-greenclip
shellcheck-bin
spotify
synology-drive
teams
timeshift-autosnap
twitch-downloader-gui
update-grub
velero-bin
visual-studio-code-bin
vmware-workstation
xkblayout-state-git
xorgxrdp
xrdp
youtube-dl
