1password
alacritty-colorscheme
google-chrome
gruvbox-dark-gtk
gruvbox-dark-icons-gtk
gruvbox-material-gtk-theme-git
gruvbox-material-icon-theme-git
jetbrains-toolbox
kube-ps1
postman-bin
rcm
shellcheck-bin
skypeforlinux-preview-bin
synology-drive
velero-bin
visual-studio-code-bin
timeshift-autosnap
btrfs-assistant
update-grub
xkblayout-state-git
i3-scrot
