# frozen_string_literal: true

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'

brew 'bat'
brew 'diff-so-fancy'
brew 'fasd'
brew 'git'
brew 'git-delta'
brew 'gnu-sed'
brew 'helm'
brew 'htop'
brew 'istioctl'
brew 'jq'
brew 'kind'
brew 'kubernetes-cli'
brew 'kubectx'
brew 'kustomize'
brew 'mysql-client@5.7'
brew 'neovim'
brew 'openssl@3'
brew 'pygments'
brew 'rcm'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'shellcheck'
brew 'sops'
brew 'subversion'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vault'
brew 'wget'

cask '1password-beta'
cask 'alacritty'
cask 'alfred'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-hasklig'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-source-code-pro'
cask 'google-chrome'
cask 'gpg-suite'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'jump-desktop-connect'
cask 'logitech-options'
cask 'microsoft-remote-desktop'
cask 'mysqlworkbench'
cask 'rectangle'
cask 'setapp'
cask 'skype'
cask 'spotify'
cask 'syncthing'
cask 'timemachineeditor'
cask 'vagrant'
cask 'visual-studio-code'
