tap 'thoughtbot/formulae'
tap 'homebrew/services'
tap 'universal-ctags/universal-ctags'

# Unix
brew 'universal-ctags', args: ['HEAD']
brew 'git'
brew 'openssl'
brew 'rcm'
brew 'reattach-to-user-namespace'
brew 'the_silver_searcher'
brew 'tmux'
brew 'vim'
brew 'watchman'
brew 'zsh'
brew 'htop'

# Image manipulation
brew 'imagemagick'

# Programming language prerequisites and package managers
brew 'libyaml' # should come after openssl
brew 'coreutils'
brew 'libxslt'
brew 'unixodbc'
brew 'unzip'
brew 'curl'
cask 'gpg-suite'

# CLI tool for quick access to files and directories
brew 'fasd'
# Generic syntax highlighter
brew 'pygments'
# Static analysis and lint tool, for (ba)sh scripts
brew 'shellcheck'
# Lightweight and flexible command-line JSON processor
brew 'jq'
# Display directories as trees (with optional color/HTML output)
brew 'tree'
# Good-lookin' diffs with diff-highlight and more
brew 'diff-so-fancy'
# Search tool like grep and The Silver Searcher
brew 'ripgrep'
# Git extension for versioning large files
brew 'git-lfs'
# Control Google Chrome from the command-line
brew 'chrome-cli'
# Clone of cat(1) with syntax highlighting and Git integration
brew 'bat'
# Java-based project management
brew 'maven'
# Ambitious Vim-fork focused on extensibility and agility
brew 'neovim'
# Internet file retriever
brew 'wget'
# Mac App Store command-line interface
brew 'mas'
# A simple terminal UI for docker, written in Go
tap 'jesseduffield/lazydocker'
brew 'lazydocker'
# Cross-platform make
brew 'cmake'
# Open source programming language to build simple/reliable/efficient software
brew 'go'
# https://unused.codes/ NOTE: it takes to long to compile in staging mac
# tap "joshuaclayton/formulae"
# brew "unused"
# Command-line Spotify interface
# https://github.com/hnarayanan/shpotify
# brew 'shpotify'
# encrypt sesnsitive data in git repo
brew 'git-crypt'
brew 'mosh'
brew 'mysql-client@5.7'
brew 'the_silver_searcher'

####### Casks #############
tap 'AdoptOpenJDK/openjdk'
cask 'adoptopenjdk8'

tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-firacode-nerd-font'
cask 'font-source-code-pro'
cask 'font-sourcecodepro-nerd-font'

cask 'chronosync'
# cask 'intellij-idea'
# cask 'datagrip'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'alacritty'
cask 'skype'
cask 'spectacle'
cask 'spotify'
cask 'timemachineeditor'
cask 'vagrant'
cask 'visual-studio-code'
cask 'vlc'
cask 'vmware-fusion'
# cask 'insync'
cask 'calibre'
cask 'send-to-kindle'
# cask "dash"
cask 'ngrok'
cask 'docker'
cask 'bitwarden'
cask 'alfred'
cask 'android-studio'
cask 'visual-studio'
cask 'dotnet-sdk'
cask 'mysqlworkbench'