# CLI tool for quick access to files and directories
brew "fasd"
# Generic syntax highlighter
brew "pygments"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Git extension for versioning large files
brew "git-lfs"
# Control Google Chrome from the command-line
brew "chrome-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Java-based project management
brew "maven", args: ["--ignore-dependencies"]
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Internet file retriever
brew "wget"
# Mac App Store command-line interface
brew "mas"
# A simple terminal UI for docker, written in Go
tap "jesseduffield/lazydocker"
brew "lazydocker"
# Cross-platform make
brew "cmake"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# https://unused.codes/ NOTE: it takes to long to compile in staging mac
# tap "joshuaclayton/formulae"
# brew "unused"
# Command-line Spotify interface
# https://github.com/hnarayanan/shpotify
brew "shpotify"

####### Casks #############
tap "AdoptOpenJDK/openjdk"
cask "adoptopenjdk8"

tap "homebrew/cask-fonts"
cask "font-fira-code"

cask "chronosync"
cask "intellij-idea"
cask "datagrip"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "iterm2"
cask "skype"
cask "spectacle"
cask "spotify"
cask "timemachineeditor"
cask "vagrant"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "insync"
cask "calibre"
cask "send-to-kindle"
# cask "dash"
cask "ngrok"
