zsh
alacritty
avahi
bat
bat-extras
bzip2
diff-so-fancy
docker
docker-buildx
docker-compose
fasd
gnome-keyring
inotify-tools
grub-btrfs
helm
htop
kubectl
kubectx
kustomize
maven
mkcert
mysql-workbench
neovim
obsidian
python-pynvim
remmina
freerdp
ripgrep-all
seahorse
sops
step-cli
the_silver_searcher
tmux
tree
ttf-firacode-nerd
ttf-sourcecodepro-nerd
vagrant
vault
percona-server-clients
k9s
power-profiles-daemon
xclip
nitrogen
picom
geoclue
redshift
