accerciser
accountsservice
acpi
adobe-source-han-sans-cn-fonts
adobe-source-han-sans-jp-fonts
adobe-source-han-sans-kr-fonts
alacritty
alsa-firmware
alsa-plugins
alsa-utils
amd-ucode
arandr
arc-gtk-theme-eos
archlinux-xdg-menu
argocd
aspell-el
awesome-terminal-fonts
b43-fwcutter
baobab
base
base-devel
bash-completion
bat
bat-extras
bind
blueman
bluez
bluez-utils
btrfs-progs
cantarell-fonts
cheese
cloud-utils
cpupower
cryptsetup
cups
cups-filters
cups-pdf
d-spy
dconf-editor
devhelp
device-mapper
dex
dhclient
diff-so-fancy
diffutils
discord
dmenu
dmidecode
dmraid
dnsmasq
docker
docker-buildx
docker-compose
dosfstools
downgrade
dracut
duf
dunst
e2fsprogs
edk2-ovmf
efibootmgr
efitools
endeavour
endeavouros-keyring
endeavouros-mirrorlist
endeavouros-skel-i3wm
endeavouros-theming
endeavouros-xfce4-terminal-colors
eos-apps-info
eos-dracut
eos-hooks
eos-lightdm-slick-theme
eos-log-tool
eos-packagelist
eos-qogir-icons
eos-quickstart
eos-rankmirrors
eos-update-notifier
epiphany
ethtool
evince
evolution
exfatprogs
f2fs-tools
fasd
feh
ffmpeg4.4
ffmpegthumbnailer
file-roller
firefox
firewalld
five-or-more
foomatic-db
foomatic-db-engine
foomatic-db-gutenprint-ppds
foomatic-db-nonfree
foomatic-db-nonfree-ppds
foomatic-db-ppds
four-in-a-row
freerdp
fsarchiver
galculator
gdm
geary
gedit
ghex
ghostscript
gimp
git
git-delta
gitg
glade
glances
gnome-2048
gnome-backgrounds
gnome-boxes
gnome-builder
gnome-calculator
gnome-calendar
gnome-characters
gnome-chess
gnome-clocks
gnome-color-manager
gnome-connections
gnome-console
gnome-contacts
gnome-control-center
gnome-devel-docs
gnome-dictionary
gnome-disk-utility
gnome-font-viewer
gnome-games
gnome-keyring
gnome-klotski
gnome-logs
gnome-mahjongg
gnome-maps
gnome-menus
gnome-mines
gnome-multi-writer
gnome-music
gnome-nibbles
gnome-notes
gnome-photos
gnome-recipes
gnome-remote-desktop
gnome-robots
gnome-session
gnome-settings-daemon
gnome-shell
gnome-shell-extensions
gnome-software
gnome-sound-recorder
gnome-sudoku
gnome-system-monitor
gnome-taquin
gnome-terminal
gnome-tetravex
gnome-text-editor
gnome-tour
gnome-tweaks
gnome-user-docs
gnome-user-share
gnome-weather
go
gparted
grilo-plugins
grub
grub-btrfs
gsfonts
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-ugly
gthumb
gtk-engine-murrine
guestfs-tools
gutenprint
gvfs
gvfs-afc
gvfs-goa
gvfs-google
gvfs-gphoto2
gvfs-mtp
gvfs-nfs
gvfs-smb
haveged
hdparm
helm
hitori
hplip
htop
hwdetect
hwinfo
i3-wm
i3blocks
i3lock
i3status
iagno
inetutils
inotify-tools
inxi
iptables-nft
iwd
jfsutils
jq
k9s
kubectl
kubectx
kustomize
lazygit
less
lf
libdvdcss
libgsf
libopenraw
libvirt
libwnck3
lightdm
lightdm-slick-greeter
lightsoff
linux
linux-firmware
linux-headers
linux-lts
linux-lts-headers
logrotate
loupe
lsb-release
lsscsi
lvm2
lxappearance-gtk3
malcontent
man-db
man-pages
maven
mdadm
meld
mesa-utils
minio-client
mkcert
mlocate
modemmanager
mpv
mtools
mysql-workbench
nano
nano-syntax-highlighting
nautilus
nemo
nemo-seahorse
neofetch
neovim
netctl
network-manager-applet
networkmanager
networkmanager-openconnect
networkmanager-openvpn
nfs-utils
nilfs-utils
nitrogen
nodejs-lts-hydrogen
noto-fonts
noto-fonts-emoji
npm
nss-mdns
ntfs-3g
ntp
numlockx
nvtop
obsidian
openbsd-netcat
openssh
openssl-1.1
orca
os-prober
otf-hasklig-nerd
packer
pacman-contrib
pavucontrol
percona-server-clients
perl
pipewire-alsa
pipewire-jack
pipewire-pulse
pkgfile
playerctl
polari
polkit-gnome
poppler-glib
power-profiles-daemon
pv
pwgen
python
python-capng
python-defusedxml
python-packaging
python-pip
python-pipx
python-pynvim
python-pyqt5
python-reportlab
python-tappy
qemu-desktop
quadrapassel
rebuild-detector
redshift
reflector
reflector-simple
reiserfsprogs
remmina
ripgrep-all
rofi
rsync
rtkit
rygel
s-nail
screenkey
scrot
seahorse
sg3_utils
simple-scan
smartmontools
snapshot
sof-firmware
solaar
sops
splix
starship
step-ca
step-cli
sudo
sushi
swell-foop
swtpm
sysfsutils
sysprof
sysstat
system-config-printer
systemd-sysvcompat
tali
tecla
terraform
texinfo
the_silver_searcher
thunar
thunar-archive-plugin
thunar-volman
thunderbird
tigervnc
tldr
tmux
totem
tracker3-miners
tree
ttf-bitstream-vera
ttf-dejavu
ttf-firacode-nerd
ttf-liberation
ttf-opensans
ttf-sourcecodepro-nerd
tumbler
unrar
unzip
upower
usb_modeswitch
usbutils
vagrant
vault
vde2
vi
vim
virt-manager
virtualbox
virtualbox-guest-iso
welcome
wget
which
wireplumber
wpa_supplicant
xbindkeys
xcape
xclip
xdg-desktop-portal-gnome
xdg-user-dirs
xdg-user-dirs-gtk
xdg-utils
xed
xf86-input-libinput
xf86-video-amdgpu
xf86-video-ati
xfce4-terminal
xfsprogs
xkeycaps
xl2tpd
xorg-server
xorg-xbacklight
xorg-xdpyinfo
xorg-xev
xorg-xinit
xorg-xinput
xorg-xkill
xorg-xrandr
xsane
xterm
yay
yelp
yq
zram-generator
zsh
