# frozen_string_literal: true

tap 'thoughtbot/formulae'
tap 'homebrew/services'
tap 'universal-ctags/universal-ctags'
tap 'jesseduffield/lazydocker'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'

# Unix
brew 'universal-ctags', args: ['HEAD']
brew 'git'
brew 'openssl'
brew 'rcm'
brew 'reattach-to-user-namespace'
brew 'the_silver_searcher'
brew 'tmux'
brew 'zsh'
brew 'htop'
brew 'gnu-sed'
# brew 'vim'
# brew 'watchman'

# Image manipulation
brew 'imagemagick'

# Programming language prerequisites and package managers
brew 'libyaml' # should come after openssl
brew 'coreutils'
brew 'libxslt'
brew 'unixodbc'
brew 'unzip'
brew 'curl'

# CLI tool for quick access to files and directories
brew 'fasd'
# Generic syntax highlighter
brew 'pygments'
# Static analysis and lint tool, for (ba)sh scripts
brew 'shellcheck'
# Lightweight and flexible command-line JSON processor
brew 'jq'
# Display directories as trees (with optional color/HTML output)
brew 'tree'
# Good looking diffs with diff-highlight and more
brew 'diff-so-fancy'
# Search tool like grep and The Silver Searcher
brew 'ripgrep'
# Git extension for versioning large files
# brew 'git-lfs'
# Clone of cat(1) with syntax highlighting and Git integration
brew 'bat'
# Ambitious Vim-fork focused on extensibility and agility
brew 'neovim', args: ['HEAD']
# Internet file retriever
brew 'wget'
# A simple terminal UI for docker, written in Go
brew 'lazydocker'
brew 'lazygit'
# Cross-platform make
brew 'cmake'
# Command-line Spotify interface
# https://github.com/hnarayanan/shpotify
brew 'shpotify'
# encrypt sesnsitive data in git repo
# brew 'git-crypt'
brew 'mosh'
brew 'mysql-client@5.7'
brew 'the_silver_searcher'
brew 'kubernetes-cli'
brew 'kube-ps1'
brew 'kubectx'
brew 'sops'
brew 'chrome-cli'

####### Casks #############
cask 'gpg-suite'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-source-code-pro'
cask 'font-sauce-code-pro-nerd-font'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'alacritty'
cask 'skype'
cask 'spotify'
cask 'timemachineeditor'
cask 'visual-studio-code'
cask 'visual-studio-code-insiders'
cask 'docker'
cask 'vagrant'
cask 'vmware-fusion'
cask 'calibre'
cask 'send-to-kindle'
cask 'alfred'
cask 'mysqlworkbench'
cask 'microsoft-remote-desktop'
cask 'rectangle'

# cask 'chronosync'
# cask 'flux'
# cask 'vlc'
# cask 'ngrok'
# cask 'android-studio'
# cask 'visual-studio'
# cask 'dotnet-sdk'
# cask 'wwdc'
