accerciser
acpi
adobe-source-han-sans-cn-fonts
adobe-source-han-sans-jp-fonts
adobe-source-han-sans-kr-fonts
alsa-firmware
alsa-plugins
alsa-utils
amd-ucode
arandr
archlinux-xdg-menu
argocd
aspell-el
awesome-terminal-fonts
b43-fwcutter
baobab
base
base-devel
bat-extras
blueman
bluez-utils
cheese
cloud-utils
cpupower
cups-pdf
dconf-editor
dex
diff-so-fancy
discord
dmraid
docker
docker-compose
downgrade
duf
dunst
efitools
endeavour
endeavouros-keyring
endeavouros-mirrorlist
endeavouros-skel-i3wm
endeavouros-xfce4-terminal-colors
eos-apps-info
eos-dracut
eos-hooks
eos-lightdm-slick-theme
eos-log-tool
eos-packagelist
eos-rankmirrors
eos-update-notifier
epiphany
ethtool
evolution
fasd
firefox
five-or-more
foomatic-db-nonfree
four-in-a-row
fsarchiver
galculator
gdm
geary
gedit
ghex
gitg
glade
glances
gnome-2048
gnome-backgrounds
gnome-boxes
gnome-builder
gnome-calculator
gnome-calendar
gnome-characters
gnome-chess
gnome-clocks
gnome-connections
gnome-console
gnome-contacts
gnome-devel-docs
gnome-dictionary
gnome-font-viewer
gnome-games
gnome-klotski
gnome-logs
gnome-mahjongg
gnome-maps
gnome-mines
gnome-multi-writer
gnome-music
gnome-nibbles
gnome-notes
gnome-photos
gnome-recipes
gnome-robots
gnome-shell-extensions
gnome-software
gnome-sound-recorder
gnome-sudoku
gnome-system-monitor
gnome-taquin
gnome-tetravex
gnome-text-editor
gnome-tour
gnome-tweaks
gnome-user-docs
gnome-weather
go
gparted
gthumb
guestfs-tools
haveged
hdparm
hitori
hplip
htop
hwdetect
hwinfo
i3blocks
iagno
inetutils
k9s
kubectx
kustomize
lazygit
lf
lightsoff
linux-lts
loupe
lsb-release
lxappearance-gtk3
man-pages
maven
minio-client
mkcert
mpv
mysql-workbench
nano-syntax-highlighting
nemo-seahorse
neovim
netctl
network-manager-applet
networkmanager-openconnect
networkmanager-openvpn
nfs-utils
ntp
nvtop
obsidian
openssl-1.1
orca
packer
pavucontrol
percona-server-clients
pkgfile
playerctl
polari
polkit-gnome
pv
pwgen
python-tappy
quadrapassel
rebuild-detector
redshift
remmina
ripgrep-all
screenkey
sg3_utils
simple-scan
snapshot
sof-firmware
solaar
sops
splix
starship
step-cli
sushi
swell-foop
sysstat
tali
terraform
the_silver_searcher
thunderbird
tldr
totem
ttf-opensans
vagrant
vault
vi
virt-manager
virtualbox
welcome
xbindkeys
xcape
xdg-user-dirs-gtk
xed
xf86-video-amdgpu
xf86-video-ati
xkeycaps
xl2tpd
xorg-xbacklight
xorg-xev
xorg-xinput
xorg-xkill
yq
zram-generator
